nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_utils.c
    /* 2Mbps*/
    /* RCCal delay in hns = -0.339*(rccal-17) ns * 2 (0.339 in fixed point s14 = 5554) */
    static_delay_hns = (((int32_t)hadm_device_p->rtt_static_comp.rttRCcal - HADM_RCCAL_CENTER) * (-5554)) / (HADM_RTT_SCALE_FACTOR>>1);

     /* CBPF attenuation delay in ns = 16.015(a-9). Since a is stored *100 => in hns = 2*16.015(a-9)/100. (16.015 in fixed point s5 = 512) */
    hadm_device_p->rtt_static_comp_hns[HADM_RTT_PHY_2MBPS] = static_delay_hns +
     (((int32_t)hadm_device_p->rtt_static_comp.rttCbpfAtt[HADM_RTT_PHY_2MBPS] - HADM_CBPF_ATTEN_CENTER_2MBPS) * 512) / (100*(1<<(5-1)));
}

/* Compute latency that has to be removed from ToA-ToD values (resp. substracted from ToD-ToA) :
 *      - nominal offset
 *      - HW contribution (HW TPM triggers vs 1st preamble bit reference)
 * Return: half ns unit
 */
void lcl_hadm_utils_calc_ts_delay(hadm_meas_t *hadm_meas_p, hadm_device_t *hadm_device)
{
    const BLE_HADM_SubeventConfig_t *hadm_config_p = hadm_meas_p->config_p;
    int32_t ts_nominal_delay;
    int32_t ts_hw_delay;

    assert(hadm_config_p->rttPhy < HADM_RTT_PHY_MAX);

    /* When reporting round-trip time to the Host, each device excludes nominal known time offsets from the reported time. This time is equivalent to the time period
     * between the reception and transmission of the center of the CS_SYNC fields, T_SY_CENTER_DELTA */
    if (hadm_meas_p->config_p->rttMode == HADM_STEP_MODE3)
    {
        /* T_SY_CENTER_DELTA = TSY + TRD + 2 x TGD + 2 x (TSW + TPM ) x NAP + (TSW + TPM ) + TIP2 if *no* physical transmission is present in the reflector to initiator transmission extension slot. */
        ts_nominal_delay = (HADM_T_SY(hadm_config_p->rttPhy) + HADM_T_RD + (2U * HADM_T_GD) + 2U * (((uint8_t)hadm_config_p->T_PM_Time + (uint8_t)hadm_config_p->T_SW_Time) * hadm_meas_p->n_ap) 
                         + ((uint8_t)hadm_config_p->T_PM_Time + (uint8_t)hadm_config_p->T_SW_Time) + (uint8_t)hadm_config_p->T_IP2_Time);
        
        hadm_meas_p->ts_extra_delay_hns = ((uint8_t)hadm_meas_p->config_p->T_PM_Time + (uint8_t)hadm_meas_p->config_p->T_SW_Time) * 2000U;
    }
    else
    {
        /* T_SY_CENTER_DELTA = TSY + TRD + TIP1 */
        ts_nominal_delay = (HADM_T_SY(hadm_config_p->rttPhy) + HADM_T_RD + hadm_config_p->T_IP1_Time);
        hadm_meas_p->ts_extra_delay_hns = 0;
    }
    /* Take payload into account */
    ts_nominal_delay += ((rtt_type_2_payload_size[hadm_config_p->rttTypes] * 32) >> ((uint8_t)hadm_config_p->rttPhy));
    
    /* Convert us to half ns */
    ts_nominal_delay *= 2000U;

    /* Coarse HW contribution:
     * TX: elapsed time between tx_dig_en (TPM trigger on TX) and 1st bit over the air
     * RX: elapsed time between last bit of AA and aa_match_to_ll (TPM trigger on RX) + duration of preamble and AA
     */
    ts_hw_delay = HADM_TX_LATENCY_NS + HADM_1ST_BIT_TO_AA_MATCH_DURATION_US(hadm_config_p->rttPhy) * 1000U;
    /* Convert to half ns */
    ts_hw_delay *= 2U;

    /* Add per-device static compensation */
    ts_hw_delay += hadm_device->rtt_static_comp_hns[hadm_config_p->rttPhy];

    /* Finer HW compensation based on characterization (EVK boards) */
    ts_hw_delay += (hadm_config_p->rttPhy == HADM_RTT_PHY_1MBPS) ? HADM_RXTX_FINE_LATENCY_1MBPS_HNS : HADM_RXTX_FINE_LATENCY_2MBPS_HNS;

    /* Perform fine tuning correction (only in normal operation, skipped during distance calibration) */
    if (hadm_config_p->distanceCalMode == HADM_DIST_CAL_MODE_DISABLED)
    {
        ts_hw_delay += hadm_device->zero_distance_comp.rttFineTuningHns[hadm_config_p->rttPhy];
    }

    /* Latency due to temperature */
    if (hadm_config_p->distanceCalMode == HADM_DIST_CAL_MODE_DISABLED)
    {
        ts_hw_delay += hadm_device->rtt_temperature_comp_hns[hadm_config_p->rttPhy];
    }

    if (hadm_config_p->role == HADM_ROLE_REFLECTOR)
    {
        hadm_meas_p->ts_hw_delay_hns = -ts_hw_delay;
    }
    else
    {
        hadm_meas_p->ts_hw_delay_hns = ts_hw_delay;
    }

    hadm_meas_p->ts_nominal_delay_hns = ts_nominal_delay;
    assert(hadm_meas_p->ts_nominal_delay_hns + hadm_meas_p->ts_hw_delay_hns > 0);
}

void lcl_hadm_enable_lcl_interrupts(void)
{
    NVIC_ClearPendingIRQ(RSM_INT_IRQn);
    EnableIRQ(RSM_INT_IRQn);
    NVIC_SetPriority(RSM_INT_IRQn, 1);
}

#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
void lcl_hadm_enable_interrupts_for_subevent(bool trig_on_tx)
{
    NVIC_ClearPendingIRQ(BRF_INT_IRQn);
    EnableIRQ(BRF_INT_IRQn);
    NVIC_SetPriority(BRF_INT_IRQn, 0);
    XCVR_TSM->CTRL |= XCVR_TSM_CTRL_TSM_IRQ0_EN_MASK;
    if (trig_on_tx)
    {
        XCVR_TSM->TIMING03 &= ~(XCVR_TSM_TIMING03_IRQ0_START_TRIG_TX_HI_MASK | XCVR_TSM_TIMING03_IRQ0_START_TRIG_TX_LO_MASK);
        XCVR_TSM->TIMING03 |= XCVR_TSM_TIMING03_IRQ0_START_TRIG_TX_HI(26) | XCVR_TSM_TIMING03_IRQ0_START_TRIG_TX_LO(27);
    }
    else
    {
        XCVR_TSM->TIMING03 &= ~(XCVR_TSM_TIMING03_IRQ0_START_TRIG_RX_HI_MASK | XCVR_TSM_TIMING03_IRQ0_START_TRIG_RX_LO_MASK);
        XCVR_TSM->TIMING03 |= XCVR_TSM_TIMING03_IRQ0_START_TRIG_RX_HI(26) | XCVR_TSM_TIMING03_IRQ0_START_TRIG_RX_LO(27);
    }
}

void lcl_hadm_restore_interrupts_for_subevent(void)
{
    DisableIRQ(BRF_INT_IRQn);
    XCVR_TSM->CTRL &= ~XCVR_TSM_CTRL_TSM_IRQ0_EN_MASK;
    XCVR_TSM->TIMING03 |= (XCVR_TSM_TIMING03_IRQ0_START_TRIG_TX_HI_MASK | XCVR_TSM_TIMING03_IRQ0_START_TRIG_TX_LO_MASK |
                           XCVR_TSM_TIMING03_IRQ0_START_TRIG_RX_HI_MASK | XCVR_TSM_TIMING03_IRQ0_START_TRIG_RX_LO_MASK);
}

/* Programm FOM register values.
 * Those values do not have to be reset after use since they are not relevant
 * without a FOM trigger (cleared via LCL_HAL_DISABLE_FO_ENTRY).
 * Return  0/1 for success/error correspondingly.
 */
uint8_t lcl_hadm_apply_cfo_per_step(int32_t cfo)
{
    uint32_t temp = (cfo >= 0) ? (uint32_t)cfo : (uint32_t)(-cfo);

    if ((cfo > 262143) || (cfo < -262143))  /* check CFO limitation: (2^32 / 16384) - 1 */
    {
        return 1U;
    }
    /* Hz to 0.95Hz unit, see XCVR_LCL_RsmCompCfo() */
    temp = ((temp * 16384U) / 15625U);
    cfo = (cfo >= 0) ? (int32_t)temp : (int32_t)(-temp);
    /* 1Mbps PHY */
    XCVR_MISC->IPS_FO_DRS0_DATA[HADM_FO_ENTRY] = XCVR_PLL_DIG_PLL_OFFSET_CTRL_PLL_NUMERATOR_OFFSET(cfo);
    /* 2 Mbps PHY */
    XCVR_MISC->IPS_FO_DRS1_DATA[HADM_FO_ENTRY] = XCVR_PLL_DIG_PLL_OFFSET_CTRL_PLL_NUMERATOR_OFFSET(cfo);

    return 0U;
}
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */

